---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU.GetFlangeThicknessInWidthCenter
source: html/36720a0a-530d-0040-9910-b74abd317a39.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU.GetFlangeThicknessInWidthCenter Method

Returns thickness of flange measured in the 0.5 * width,
 sometimes used for sections with width <= 300 mm.

## Syntax (C#)
```csharp
public double GetFlangeThicknessInWidthCenter()
```